express/load-test/3900-vus

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: ./scripts/load-test-get.js

    duration: -, iterations: -
         vus: 1, max: 3900

    init [----------------------------------------------------------] starting
    ✓ is status 200

    checks.....................: 100.00% ✓ 116937 ✗ 0     
    data_received..............: 24 MB   400 kB/s
    data_sent..................: 9.2 MB  153 kB/s
    http_req_blocked...........: avg=79.03µs  min=4.5µs  med=7.7µs    max=17.55ms p(90)=13.3µs   p(95)=22.71µs 
    http_req_connecting........: avg=67.99µs  min=0s     med=0s       max=17.46ms p(90)=0s       p(95)=0s      
  ✗ http_req_duration..........: avg=499.28ms min=1.08ms med=701.44ms max=1.07s   p(90)=784.37ms p(95)=839.65ms
    http_req_receiving.........: avg=57.8µs   min=20µs   med=48.8µs   max=30.23ms p(90)=74.9µs   p(95)=89.1µs  
    http_req_sending...........: avg=20.59µs  min=7.1µs  med=14.7µs   max=7.35ms  p(90)=25.5µs   p(95)=42.11µs 
    http_req_tls_handshaking...: avg=0s       min=0s     med=0s       max=0s      p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=499.2ms  min=1.03ms med=701.33ms max=1.07s   p(90)=784.29ms p(95)=839.55ms
    http_reqs..................: 116937  1948.921393/s
    iteration_duration.........: avg=1.49s    min=1s     med=1.7s     max=2.08s   p(90)=1.77s    p(95)=1.8s    
    iterations.................: 114956  1915.905211/s
    vus........................: 3900    min=126  max=3900
    vus_max....................: 3900    min=3900 max=3900


          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

    init [----------------------------------------------------------]   engine